chat_system_1195220771_actor_description=Chief Engineer Debat. Dwarf.
chat_system_1195220771_snap_1_question=^?^Ah, [player]! I'm glad to see you again... You must have come to have a look at our new inventions? Or just to have a chat?
chat_system_1195220771_snap_1_answer_0=^?^I need to get to the Dragons' Labyrinth, so your king sent me here to Mehgard.
chat_system_1195220771_snap_1_answer_1=^?^Look dwarf, have you really managed to create an artificial lightning - without any magic?
chat_system_1195220771_snap_1_answer_2=^?^And where can I find the Key?
chat_system_1195220771_snap_1_header_2=^?^Where's the key, you ask? In Demonis, of course! When orcs fled, all that they had stolen fell into the hands of the demons. They must be keeping the key in one of their well-protected castles. We can't close the Magic Portal without this key, so the demons will continue to devastate Kordar, and then they will reach you, humans...
chat_system_1195220771_snap_1_answer_3=^?^Tell me about this Portal. Do you really deal with magic?
chat_system_1195220771_snap_1_header_3=^?^Dwarves used to use magic long ago. Rather successfully, I might add. This damned Portal, the passage to the other world, was the greatest achievement of our mages... What kind of a world was it? What would be waiting for us there? Nobody thought to ask! All they cared about was the amazing success, what we managed, that we succeeded...<br>Thus we nearly signed the death-warrant for the whole race of dwarves, for the Portal led to Demonis, the world of aggressive and bloodthirsty demons, they who conquer and rob other worlds...<br>...When the Portal was closed, the demons who remained were destroyed. It was then decided that the dwarven race would refuse to use divine and natural magic forever, and from that time forward would develop science and mechanics, using natural laws, not supernatural powers. So, in creating the Portal, the mages doomed themselves to oblivion, and opened a new era for the dwarven race - the era of science and mechanics! Just look at what we've achieved over these thousands of years!<br>
chat_system_1195220771_snap_1_answer_4=^?^I'd like to have a look at your equipment!
chat_system_1195220771_snap_1_answer_5=^?^Do you have any special inventions?
chat_system_1195220771_snap_1_header_5=^?^We invent something every hour! Of course, not all of the inventions work, and some do more harm than good, ha-ha...<br>However, if you visited the storehouse, you've seen a newly improved version of the miner lantern. It shines much better! Also, we're now just finishing the tests of a new mechanical protective device - steam armor.<br>
chat_system_1195220771_snap_1_answer_6=^?^Tell me about the science! It's extremely interesting!
chat_system_1195220771_snap_1_header_6=^?^You see, everything that happens submits to the laws of nature. Science studies these laws and engineering tries to use them in some way. I could give you a long lecture on the subject, but you wouldn't understand it.
chat_system_1195220771_snap_1_answer_7=^?^What's that hanging in the air on a chain down there?
chat_system_1195220771_snap_1_header_7=^?^Interesting, isn't it? That was taken from the Demon's Land by our specialists. We study it, perform experiments on it. Their world is a world of flying islands! But we haven't found out how they fly as yet...
chat_system_1195220771_snap_1_answer_8=^?^I have to go. See you!
chat_system_1195220771_snap_3_question=^?^Wait, wait! How did you know about that? Could somebody have blabbed about it?
chat_system_1195220771_snap_3_answer_0=^?^Well... I have a reliable source of information. So how did you manage to tame the lightning?
chat_system_1195220771_snap_4_question=^?^Well, you see... We can not only catch lightning, but create it ourselves! In fact, it's not so difficult... Have you ever patted a shaggy rat with an ebonite stick?
chat_system_1195220771_snap_4_answer_0=^?^I don't pat rats with sticks. Stop dodging the question. What if I wanted to contribute to the development of science?!
chat_system_1195220771_snap_5_question=^?^So you're a sponsor? Well gold is always useful! Ok, here's what am I trying to explain - to a human no less! Well, you'd better just have a look at a model of a Large Glass Lightning Storage Device in action!<br>I think, you'll be impressed by what you see. The key point is that the apparatus is driven by pure science - no magic whatsoever! You get on top, there is a preservation can...<br>
chat_system_1195220771_snap_5_answer_0=^?^I didn't get it - a can of food?
chat_system_1195220771_snap_6_question=^?^Don't interrupt me, human! No not canned food, although we do call our invention a Thunder Can for short!<br>Anyway, climb to the top and there you'll see the lightning catcher, though it doesn't work now. The working one you can find in Upper Hadar. You can even try to strike something with lightning. Just put something you don't need onto the black circle and pull the lever. The lightning will strike the circle. Got it?<br>
chat_system_1195220771_snap_6_answer_0=^?^Put it into the circle, pull the lever... Got it, thank you!
chat_system_1195220771_snap_0_question=^?^Well, well, well. Who decided to visit our stronghold of science and technology? A humanoid, I would say... a native of Darion!
chat_system_1195220771_snap_0_answer_0=^?^What an insight! I really am from Darion. Who are you? And what is the place?
chat_system_1195220771_snap_2_question=^?^Let me introduce myself. My name is Debat, and at the moment I occupy the position of the Chief Engineer of Kordar.<br>This place is called Mehgard. This is the center of scientific and technological research of our country! All our intellectual and productive force is concentrated on this small plot of land. It's a strategically important center, so we are rather isolated.<br>
chat_system_1195220771_snap_2_answer_0=^?^Oh... It's all very difficult. And so many new words...
chat_system_1195220771_snap_2_header_0=^?^That's ok. Don't be shy to ask questions. I seldom have guests, and I have a lot to brag about. Heh heh.
chat_system_1195220771_snap_1_answer_9=^?^Can you do anything with extra talent runes?
chat_system_1195220771_snap_1_answer_10=^?^About your talent rune machine...
chat_system_1195220771_snap_15_question=^?^I do have this fancy invention here that can exchange talent runes from one kind to another. In fact the more you trade, the more efficient it gets! I'm quite proud of this invention and I've been wanting to try it out for a long time!
chat_system_1195220771_snap_15_answer_0=^?^Really? You have a machine that can exchange talent runes? And what do you mean by try out?
chat_system_1195220771_snap_16_question=^?^Yes, human, but it's a prototype. I can personally guarantee, though, that it will work - do you want to try it?
chat_system_1195220771_snap_16_answer_0=^?^Yes! Let's see what this machine can do!
chat_system_1195220771_snap_16_answer_1=^?^Prototype? Maybe later - show me your shop instead...
chat_system_1195220771_snap_16_answer_2=^?^Yes, but I don't have time to trade right now - I'll be back later...
chat_system_1195220771_snap_17_question=^?^[s]You have the following talent runes:<br>[img_rune_might] Might Runes: <itm=@hero?rune_might.count> <br>[img_rune_mind] Mind Runes: <itm=@hero?rune_mind.count> <br>[img_rune_magic] Magic Runes: <itm=@hero?rune_magic.count>[/s]<br><br>Let me tell you how this machine works! I'm so excited! As I said earlier, the more you exchange, the more efficient it gets. Here's what it does:<br>- For 2 runes you get 1.<br>- With 3 runes you get 2.<br>- 4 and you'll get back 3.<br>That last one is pretty efficient – you get 75% back! Unfortunately, it can't handle any more than 4 runes at a time making that the maximum you can exchange in one go. So, do you want to try out the machine?
chat_system_1195220771_snap_17_answer_0=^?^I'll exchange my [img_rune_might] Runes of Might.
chat_system_1195220771_snap_17_answer_1=^?^I want to exchange my [img_rune_mind] Runes of Mind.
chat_system_1195220771_snap_17_answer_2=^?^Trade me for my [img_rune_magic] Runes of Magic.
chat_system_1195220771_snap_17_answer_3=^?^I've changed my mind - can you show my your shop instead?
chat_system_1195220771_snap_17_answer_4=^?^Well, maybe later - I'll be back...
chat_system_1195220771_snap_18_question=^?^Let's see, for [img_rune_might] the machine outputs [img_rune_magic] or [img_rune_mind]: <br>- For 2 runes you get 1.<br>- With 3 runes you'll get back 2.<br>- 4 and you'll get back 3.<br>How many do you want to put in the machine? <br><br>[s]You have the following talent runes:<br>[img_rune_might] Might Runes: <itm=@hero?rune_might.count> <br>[img_rune_mind] Mind Runes: <itm=@hero?rune_mind.count> <br>[img_rune_magic] Magic Runes: <itm=@hero?rune_magic.count>[/s]
chat_system_1195220771_snap_18_answer_0=^?^Exchange 2 [img_rune_might] red for 1 [img_rune_mind] green!
chat_system_1195220771_snap_18_answer_1=^?^Exchange 3 [img_rune_might] red for 2 [img_rune_mind] green!
chat_system_1195220771_snap_18_answer_2=^?^Exchange 4 [img_rune_might] red for 3 [img_rune_mind] green!
chat_system_1195220771_snap_18_answer_3=^?^Exchange 2 [img_rune_might] red for 1 [img_rune_magic] blue!
chat_system_1195220771_snap_18_answer_4=^?^Exchange 3 [img_rune_might] red for 2 [img_rune_magic] blue!
chat_system_1195220771_snap_18_answer_5=^?^Exchange 4 [img_rune_might] red for 3 [img_rune_magic] blue!
chat_system_1195220771_snap_18_answer_6=^?^I've changed my mind, let's trade something else...
chat_system_1195220771_snap_18_answer_7=^?^I've changed my mind. I will come back later...
chat_system_1195220771_snap_19_question=^?^Let's see, for [img_rune_mind] the machine outputs [img_rune_might] or [img_rune_magic]: <br>- For 2 runes you get 1.<br>- With 3 runes you'll get back 2.<br>- 4 and you'll get back 3.<br>How many do you want to put in the machine? <br><br>[s]You have the following talent runes:<br>[img_rune_might] Might Runes: <itm=@hero?rune_might.count> <br>[img_rune_mind] Mind Runes: <itm=@hero?rune_mind.count> <br>[img_rune_magic] Magic Runes: <itm=@hero?rune_magic.count>[/s]
chat_system_1195220771_snap_19_answer_0=^?^Exchange 2 [img_rune_mind] green for 1 [img_rune_might] red!
chat_system_1195220771_snap_19_answer_1=^?^Exchange 3 [img_rune_mind] green for 2 [img_rune_might] red!
chat_system_1195220771_snap_19_answer_2=^?^Exchange 4 [img_rune_mind] green for 3 [img_rune_might] red!
chat_system_1195220771_snap_19_answer_3=^?^Exchange 2 [img_rune_mind] green for 1 [img_rune_magic] blue!
chat_system_1195220771_snap_19_answer_4=^?^Exchange 3 [img_rune_mind] green for 2 [img_rune_magic] blue!
chat_system_1195220771_snap_19_answer_5=^?^Exchange 4 [img_rune_mind] green for 3 [img_rune_magic] blue!
chat_system_1195220771_snap_19_answer_6=^?^I've changed my mind, let's trade something else...
chat_system_1195220771_snap_19_answer_7=^?^I've changed my mind. I will come back later...
chat_system_1195220771_snap_20_question=^?^Let's see, for [img_rune_magic] the machine outputs [img_rune_might] or [img_rune_mind]: <br>- For 2 runes you get 1.<br>- With 3 runes you'll get back 2.<br>- 4 and you'll get back 3.<br>How many do you want to put in the machine? <br><br>[s]You have the following talent runes:<br>[img_rune_might] Might Runes: <itm=@hero?rune_might.count> <br>[img_rune_mind] Mind Runes: <itm=@hero?rune_mind.count> <br>[img_rune_magic] Magic Runes: <itm=@hero?rune_magic.count>[/s]
chat_system_1195220771_snap_20_answer_0=^?^Exchange 2 [img_rune_magic] blue for 1 [img_rune_might] red!
chat_system_1195220771_snap_20_answer_1=^?^Exchange 3 [img_rune_magic] blue for 2 [img_rune_might] red!
chat_system_1195220771_snap_20_answer_2=^?^Exchange 4 [img_rune_magic] blue for 3 [img_rune_might] red!
chat_system_1195220771_snap_20_answer_3=^?^Exchange 2 [img_rune_magic] blue for 1 [img_rune_mind] green!
chat_system_1195220771_snap_20_answer_4=^?^Exchange 3 [img_rune_magic] blue for 2 [img_rune_mind] green!
chat_system_1195220771_snap_20_answer_5=^?^Exchange 4 [img_rune_magic] blue for 3 [img_rune_mind] green!
chat_system_1195220771_snap_20_answer_6=^?^I've changed my mind, let's trade something else...
chat_system_1195220771_snap_20_answer_7=^?^I've changed my mind. I will come back later...
chat_system_1195220771_switch_2_header_0=^?^[s]After the process completes, you have the following talent runes:<br>[img_rune_might] Might Runes: <itm=@hero?rune_might.count> <br>[img_rune_mind] Mind Runes: <itm=@hero?rune_mind.count> <br>[img_rune_magic] Magic Runes: <itm=@hero?rune_magic.count>[/s]<br><br>You hand the runes to Debat and he puts each rune into a color-coded slot matching the input and output rune colors...<br>[s]You then hear the strangest sounds - whirs, grinds, and other noises that are hard to describe. After a few moments the color of the runes that you wanted fall out of the machine and he scoops them up and gives them to you.[/s]<br>Pretty neat, huh? Here are your runes. Do you want to use the machine again?
chat_system_1195220771_switch_3_header_0=^?^[s]After the process completes, you have the following talent runes:<br>[img_rune_might] Might Runes: <itm=@hero?rune_might.count> <br>[img_rune_mind] Mind Runes: <itm=@hero?rune_mind.count> <br>[img_rune_magic] Magic Runes: <itm=@hero?rune_magic.count>[/s]<br><br>You hand the runes to Debat and he puts each rune into a color-coded slot matching the input and output rune colors...<br>[s]You then hear the strangest sounds - whirs, grinds, and other noises that are hard to describe. After a few moments the color of the rune that you wanted falls out of the machine and he scoops it up and gives it to you.[/s]<br>Pretty neat, huh? Here is your rune. Do you want to use the machine again?